# RMS Titanic

## O RMS Titanic foi um navio de passageiros britânico operado pela White Star Line e construído pelos estaleiros da Harland and Wolff em Belfast. Foi a segunda embarcação da Classe Olympic de transatlânticos depois do RMS Olympic e seguido pelo HMHS Britannic. Projetado pelos engenheiros navais Alexander Carlisle e Thomas Andrews, sua construção começou em março de 1909 e ele foi lançado ao mar em maio de 1911. O Titanic foi pensado para ser o navio mais luxuoso e mais seguro de sua época, gerando lendas que era supostamente "inafundável".

## A embarcação partiu em sua viagem inaugural de Southampton para Nova Iorque em 10 de abril de 1912, no caminho passando em Cherbourg-Octeville na França e por Queenstown na Irlanda. Ele colidiu com um iceberg às 23h40min do dia 14 de abril e afundou na madrugada do dia seguinte matando mais de 1500 pessoas, sendo um dos maiores desastres marítimos em tempos de paz de toda a história. Seu naufrágio destacou vários pontos fracos de seu projeto, deficiências nos procedimentos de evacuação de emergência e falhas nas regulamentações marítimas da época. Comissões de inquérito foram instauradas nos Estados Unidos e no Reino Unido, levando a mudanças nas leis internacionais de navegação que permanecem em vigor mais de um século depois.

## Os destroços do Titanic foram procurados por décadas até serem encontrados em 1985 por uma equipe liderada por Robert Ballard. Ele se encontra a 3843 m de profundidade e a 650 km ao sudeste de Terra Nova no Canadá. Sua história e naufrágio permaneceram no imaginário popular durante décadas, levando a produção de vários livros e filmes a seu respeito, mais notavelmente o filme Titanic de 1997. Até hoje o Titanic permanece como um dos navios mais famosos da história, com seus destroços atraindo várias expedições de exploração ao longo dos anos.

*Fonte:* [WikiPedia](https://pt.wikipedia.org/wiki/RMS_Titanic)

--------

## A equipa da [Udacity](https://udacity.com) conseguiu coletar informações sobre uma parte dos passageiros à bordo do RMS Titanic no dia daquela tragédia. Esse _dataset_ que contém informações reais vem sendo utilizado em diversos estudos de caso, além de servir de base para aprendizado de Ciência de Dados, Estatística e Machine Learning.

## O arquivo **titanic_data.csv** contém informações reais sobre 891 passageiros organizadas da seguinte forma:

- Survived (Sobreviveu): 0 = Não, 1 = Sim
- Pclass (Classe): Classe de ingresso 1 = 1º, 2 = 2º, 3 = 3º
- Sex (Sexo): Sexo do passageiro
- Age (Idade): Idade em anos
- Sibsp: Quantidade de irmãos / cônjuges a bordo do Titanic
- Parch: Quantidade de pais / crianças a bordo do Titanic
- Ticket (Bilhete): Número do bilhete de embarque
- Fare (Tarifa): Tarifa paga pelo Passageiro
- Cabin (Cabine): Número de cabine
- Embarked (Embarque): Porto de Embarque (C = Cherbourg, Q = Queenstown, S = Southampton)

## O objetivo deste estudo é obter algumas informações estatísticas sobre a tragédia e realizar alguns _insights_ a respeito dos tripulantes e das circunstâncias do acidente.

## Efetue a carga do arquivo através da biblioteca _Pandas_ e a partir do _DataFrame_ gerado, efetue as operações necessárias para responder as questões.

In [1]:
import pandas as pd
import numpy as np

## Importando o DataSet

### 1 - Efetuar a leitura do dataset através do Pandas, gerando um DataFrame de nome tit, levando-se em consideração que o arquivo encontra-se na mesma pasta do notebook.

In [2]:
tit = pd.read_csv('titanic_data.csv')

## Conhecendo o DataSet

### 2 - Quantas linhas e colunas tem o dataset? Quais os tipos das colunas?

In [5]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
# linhas
tit.shape[0]

891

In [4]:
# colunas
tit.shape[1]

12

### 3 - Mostre os dados dos dez primeiros e 8 últimos registros do dataset.

In [6]:
tit.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [7]:
tit.tail(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.500,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

### 4 - Cálculos envolvendo colunas numéricas com dados faltantes podem sofrer impacto. É possível afirmar se há dados faltantes no dataset? Caso positivo, quais e quantos seriam esses dados? Preencha os dados faltantes de forma que não influenciem em operações futuras.

In [8]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
tit.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [13]:
lost = (tit.count() < tit.shape[0])[(tit.count() < tit.shape[0]) == True].index
[{x:len(tit[tit[x].isnull()])} for x in lost]

[{'Age': 177}, {'Cabin': 687}, {'Embarked': 2}]

In [14]:
tit.fillna(value={'Age': int(tit['Age'].mean()), 'Cabin': 0, 'Embarked': 0}, inplace=True)

## Adequando o DataSet

### 4 - Uma vez que algumas colunas não serão utilizadas, eventualmente é melhor excluí-las para que não interfiram na análise. Assim, exclua do dataset as colunas Sibsp, Parch e Ticket.

In [16]:
tit.drop(['SibSp', 'Parch', 'Ticket'], inplace=True, axis=1)

In [17]:
tit.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,S

### 5 - Renomear as colunas para a lingua portuguesa, utilizando os seguintes nomes de colunas: IdPassageiro, Sobreviveu, Classe, Nome, Sexo, Idade, Tarifa, Cabine e Embarque.

In [18]:
tit.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 'Tarifa', 'Cabine', 'Embarque']

### 6 - Alterar o conteudo da coluna Sobreviveu para:
- 0 => Não
- 1 => Sim

In [19]:
tit['Sobreviveu'] = tit['Sobreviveu'].map({0:'Não', 1:'Sim'})

### 7 - Alterar o conteudo da coluna Sexo para:
- female => Mulher
- male   => Homem

In [20]:
tit['Sexo'] = tit['Sexo'].map({'female':'Mulher', 'male':'Homem'})

## Alguns números

### 8 - Quantas mulheres e quantos homems estavam à bordo, de acordo com o dataset?

In [21]:
tit['Sexo'].value_counts()

Homem     577
Mulher    314
Name: Sexo, dtype: int64

### 9 - Quantos passageiros sobreviveram e quantos não sobreviveram?

In [22]:
tit['Sobreviveu'].value_counts()

Não    549
Sim    342
Name: Sobreviveu, dtype: int64

### 10 - Quantas mulheres não sobreviveram?

In [23]:
len(tit[(tit['Sexo'] == 'Mulher') & (tit['Sobreviveu'] == 'Não')])

81

### 11 - Proporcionalmente, sobreviveram mais homens ou mais mulheres? Cite as proporções.

In [24]:
s = tit['Sobreviveu'] == 'Sim'
h = tit['Sexo'] == 'Homem'
m = tit['Sexo'] == 'Mulher'
ph = (len(tit[s & h]) / len(tit[h])) * 100
pm = (len(tit[s & m]) / len(tit[m])) * 100

In [25]:
x = tit[s & h]

In [26]:
ph

18.890814558058924

In [27]:
pm

74.20382165605095

### 12 - Levando-se em consideração a idade dos passageiros, qual a idade e quantidade de pessoas com o maior número de mortos?

In [29]:
tit[(tit['Sobreviveu'] =='Não') & (tit['Idade'] > 0)]['Idade'].value_counts().head(1)

29.0    137
Name: Idade, dtype: int64

### 13 - Qual a média de idade dos homens sobreviventes?

In [30]:
tit[(tit['Sobreviveu'] == 'Sim') & (tit['Sexo'] == 'Homem')]['Idade'].mean()

27.52908256880734

### 14 - Levando-se em consideração passageiros prioritários (mulheres e crianças de até 15 anos independente do sexo) qual a proporção de sobreviventes por sexo?

In [31]:
prior = (tit['Sobreviveu'] == 'Sim') & (tit['Idade'] > 0) & (tit['Idade'] <= 15) | (tit['Sexo'] == 'Mulher')
tit[prior].groupby('Sexo').size() / len(tit[prior]) * 100

Sexo
Homem      6.268657
Mulher    93.731343
dtype: float64

### 15 - Qual a quantidade de passageiros por classe?

In [32]:
tit.groupby(by='Classe').size()

Classe
1    216
2    184
3    491
dtype: int64

### 16 - Qual o percentual de sobreviventes por classe?

In [33]:
tit[tit['Sobreviveu'] == 'Sim'].groupby('Classe').size() / len(tit[tit['Sobreviveu'] == 'Sim']) * 100

Classe
1    39.766082
2    25.438596
3    34.795322
dtype: float64

### 17 - Crie um dataframe que demonstre a quantidade de sobreviventes e não sobreviventes de agrupados por sexo e classe.

In [37]:
tit.groupby(['Sexo', 'Classe', 'Sobreviveu']).size().unstack(level=0)

Sexo               Homem  Mulher
Classe Sobreviveu
1      Não            77       3
       Sim            45      91
2      Não            91       6
       Sim            17      70
3      Não           300      72
       Sim            47      72

### 18 - Dos homens com idade entre 24 e 30 anos quantos da classe 3 sobreviveram? Quantos da classe 2 não sobreviveram?

In [38]:
tit[(tit['Idade'] >= 24) & (tit['Idade'] <= 30) & 
    (tit['Sexo'] == 'Homem')].groupby(['Classe', 'Sobreviveu']).size().unstack()

Sobreviveu  Não  Sim
Classe
1            24   13
2            31    2
3           138   21

### 19 - Calcule a probabilidade condicional de uma pessoa sobreviver, dado seu sexo e a classe em que estava viajando:
- P(S= true | G=female,C=1)
- P(S= true | G=female,C=2)
- P(S= true | G=female,C=3)
- P(S= true | G=male,C=1)
- P(S= true | G=male,C=2)
- P(S= true | G=male,C=3)

In [39]:
p = tit.groupby(by=['Sexo','Classe','Sobreviveu']).size()

pc1 = p['Mulher'][1]['Sim'] / p['Mulher'][1].sum()
pc2 = p['Mulher'][2]['Sim'] / p['Mulher'][2].sum()
pc3 = p['Mulher'][3]['Sim'] / p['Mulher'][3].sum()
pc4 = p['Homem'][1]['Sim'] / p['Homem'][1].sum()
pc5 = p['Homem'][2]['Sim'] / p['Homem'][2].sum()
pc6 = p['Homem'][3]['Sim'] / p['Homem'][3].sum()


print('Mulher, classe 1: {}'.format(pc1 * 100))
print('Mulher, classe 2: {}'.format(pc2 * 100))
print('Mulher, classe 3: {}'.format(pc3 * 100))
print('Homem, classe 1: {}'.format(pc4 * 100))
print('Homem, classe 2: {}'.format(pc5 * 100))
print('Homem, classe 3: {}'.format(pc6 * 100))

Mulher, classe 1: 96.80851063829788
Mulher, classe 2: 92.10526315789474
Mulher, classe 3: 50.0
Homem, classe 1: 36.885245901639344
Homem, classe 2: 15.74074074074074
Homem, classe 3: 13.544668587896252